In [ ]:
s1="hello how are you i am from london and you are from tokyo"
s2="so hi hello india and mathura"

In [ ]:
s1=sent.split(' ')

In [ ]:
import pandas as pd
df1=pd.DataFrame({'words':[s1,s2]})

In [ ]:
df1

                                               words
0  hello how are you i am from london and you are...
1                      so hi hello india and mathura

In [ ]:
df1=df1.join(df1.pop("words").str.split(" ").explode(True), how="right")

In [ ]:
df1

      words
0     hello
1       how
2       are
3       you
4         i
5        am
6      from
7    london
8       and
9       you
10      are
11     from
12    tokyo
13       so
14       hi
15    hello
16    india
17      and
18  mathura

In [ ]:
class preprocessing:
  def __init__(self,data):
    self.data=data
  def func1(self):
    self.data['entity']=pd.np.where(self.data['words'].str.contains('london'),'loc',
                           pd.np.where(self.data['words'].str.contains('tokyo'),'loc','o'))
    return self.data

In [ ]:
pre=preprocessing(df1)

In [ ]:
pre.func1()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead

      words entity
0     hello      o
1       how      o
2       are      o
3       you      o
4         i      o
5        am      o
6      from      o
7    london    loc
8       and      o
9       you      o
10      are      o
11     from      o
12    tokyo    loc
13       so      o
14       hi      o
15    hello      o
16    india      o
17      and      o
18  mathura      o

In [ ]:
df1.words.str.split(' ').tolist()

[['hello',
  'how',
  'are',
  'you',
  'i',
  'am',
  'from',
  'london',
  'and',
  'you',
  'are',
  'from',
  'tokyo'],
 ['so', 'hi', 'hello', 'india', 'and', 'mathura']]

In [ ]:
df1

      0    1      2      3    4   ...    8     9     10    11     12
0  hello  how    are    you    i  ...   and   you   are  from  tokyo
1     so   hi  hello  india  and  ...  None  None  None  None   None

[2 rows x 13 columns]

In [ ]:
df1.transpose()

   sentence1 sentence2
0      hello        so
1        how        hi
2        are     hello
3        you     india
4          i       and
5         am   mathura
6       from      None
7     london      None
8        and      None
9        you      None
10       are      None
11      from      None
12     tokyo      None

In [ ]:
df1.replace('', np.nan).set_index('sentence1').stack().reset_index(name='tag').drop('level_1',1)

In [ ]:
d = [pd.DataFrame(df1[col].tolist()).add_prefix(col) for col in df1.columns]

In [ ]:
d.strdf.split(' ')

In [ ]:
df = pd.concat(d, axis=1)

In [ ]:
df

                                              words0
0  hello how are you i am from london and you are...
1                      so hi hello india and mathura

In [ ]:
df1.words.str.split(expand=True).tolist()

In [ ]:
data

       words entity
0    [hello]      o
1      [how]      o
2      [are]      o
3      [you]      o
4        [i]      o
5       [am]      o
6     [from]      o
7   [london]    loc
8      [and]      o
9      [you]      o
10     [are]      o
11    [from]      o
12   [tokyo]    loc

In [ ]:
s1

['hello',
 'how',
 'are',
 'you',
 'i',
 'am',
 'from',
 'london',
 'and',
 'you',
 'are',
 'from',
 'tokyo']

In [ ]:
import pandas as pd
data=pd.DataFrame({'words':s1})

In [ ]:
data

     words
0    hello
1      how
2      are
3      you
4        i
5       am
6     from
7   london
8      and
9      you
10     are
11    from
12   tokyo

In [ ]:
import numpy as np

In [ ]:
class preprocessing:
  def __init__(self,data):
    self.data=data
  def func1(self):
    data['entity']=pd.np.where(data['words'].str.contains('london'),'loc',
                           pd.np.where(data['words'].str.contains('tokyo'),'loc','o'))
    return data

In [ ]:
pre=preprocessing(data)

In [ ]:
data=pre.func1()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead

In [ ]:
data

     words entity
0    hello      o
1      how      o
2      are      o
3      you      o
4        i      o
5       am      o
6     from      o
7   london    loc
8      and      o
9      you      o
10     are      o
11    from      o
12   tokyo    loc

In [ ]:
import numpy as np

In [ ]:
data['entity']=pd.np.where(data['words'].str.contains('london'),'loc',
                           pd.np.where(data['words'].str.contains('tokyp'),'loc','o'))

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead

In [ ]:
data

In [ ]:
def func1(x):
  if np.where(x=='london'):
    return 'loc'
  else:
    return 'nonw'

In [ ]:
import numpy as np
def dd(x):
  for i in x:

    if i=='london':
      return 1
    else:
      return 0

In [ ]:
dd(data['words'])

In [ ]:
data['enti']=dd(data['words'])

In [ ]:
data

     words entity  enti
0    hello   none     0
1      how   none     0
2      are   none     0
3      you   none     0
4        i   none     0
5       am   none     0
6     from   none     0
7   london   none     0
8      and   none     0
9      you   none     0
10     are   none     0
11    from   none     0
12   tokyo    loc     0